UVUtils.almostEqual(UVUtils.UV!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,UVUtils.UV!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Returns true when the two vectors are almost equal.
NOTE that the applied tolerance scales with the length of the
vectors.
USE WITH CAUTION
In 3D modeling, a tolerance such as Revit's vertex tolerance
(TessEpsCntrl::getVertexEps) should be used.
Use this only in special cases."

UVUtils.asUnitOrZero(UVUtils.UV!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Convert the input xyz into a unit vector.
IF the input vector cannot be normalized
THEN the function will return a zero vector.

UVUtils.asUnit(UVUtils.UV!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Convert the input xyz into a unit vector.
IF the vector cannot be normalized
THEN the function will return std::nullopt.

UVUtils.midpoint(UVUtils.UV!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,UVUtils.UV!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Returns the midpoint between to vectors.

UVUtils.cross(UVUtils.UV!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,UVUtils.UV!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Treats lhs and rhs as vectors and returns their cross product.

UVUtils.dot(UVUtils.UV!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,UVUtils.UV!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Returns the dot product of the two input vectors. If the input is a point rather than a vector it is
not mathematically valid, but is implicitly equivalent to the vector from the origin to the point.
That is, dot(pt1, pt2) is dot(p1 - UV::zero(), pt2 - UV::zero()).